from kiwipiepy import Kiwi
import re
import pandas as pd
concept_list = [
        
        #초등
        "삼각형", "사각형", "원", "꼭짓점", "변", "오각형" , "육각형", "표", "그래프", "나눗셈", "몫", "분수", "분모", "분자", "단위분수", "진분수", "가분수", "대분수", "자연수", 
        "소수", "소수점", "직선", "선분", "반직선", "각", "꼭짓점", "변", "직각", "예각", "둔각", "수직", "수선", "평행", "평행선", "원의 중심", "반지름", '지름', '이등변삼각형', 
        '정삼각형', '직각삼각형', '예각삼각형', '둔각삼각형', '직사각형', '정사각형', '사다리꼴','평행사변형', '마름모', '다각형', '정다각형', '대각선', '그림그래프', '막대그래프', 
        '꺾은선그래프', '약수', '공약수', '최대공약수', '배수', '공배수', '최소공배수', '약분', '통분', '기약분수', '합동', '대칭', '대응점', '대응변', '대응각', '선대칭도형', '점대칭도형', 
        '대칭축', '대칭의 중심', '직육면체', '정육면체', '면', '모서리', '밑면', '옆면', '겨냥도', '전개도', '각기둥', '각뿔', '원기둥', '원뿔', '구', '모선', '이상', '이하', '초과', 
        '미만', '올림', '버림', '반올림', '가로', '세로', '밑변', '높이', '원주', '원주율' ,'비','기준량','비교하는양','비율','백분율','비례식', '비례배분', '평균', '띠그래프', '원그래프', 
        '가능성',
        
        #중등
        '소수', '합성수', '거듭제곱', '지수', '밑', '소인수', '소인수분해', '서로소', '양수', '음수', '양의 정수', '음의 정수', '정수', '수직선', '양의 유리수', '음의 유리수', '유리수', 
        '절댓값', '교환법칙', '결합법칙', '분배법칙', '역수', '유한소수', '무한소수', '순환소수', '순환마디', '제곱근', '근호', '무리수', '실수', '분모의 유리화', '양의 부호' , '음의 부호',
        '대입', '다항식', '항','단항식', '상수항', '계수', '차수', '일차식', '동류항', '등식', '방정식', '미지수', '해', '근', '항등식', '이항', '일차방정식', '전개', '부등식', '일차부등식', 
        '연립방정식', '인수', '인수분해', '완전제곱식', '이차방정식', '중근', '근의 공식', '변수', '좌표', '순서쌍', '좌표', '원점', '좌표축', '축', '좌표평면', '제1사분면', '제2사분면', 
        '제3사분면', '제4사분면', '그래프', '정비례', '반비례', '함수', '함숫값', '일차함수', '기울기', '절편', '절편', '평행이동', '직선의 방정식', '이차함수', '포물선', '축', '꼭짓점', 
        '교점', '교선', '두 점 사이의 거리', '중점', '수직이등분선', '꼬인 위치', '교각', '맞꼭지각', '엇각', '동위각','평각', '직교', '수선의 발', '작도', '대변', '대각', '합동 조건', 
        '내각', '외각', '부채꼴', '중심각', '호','현', '활꼴', '할선', '다면체', '각뿔대', '정다면체', '원뿔대', '회전체', '회전축', '접선', '접점', '접한다', '외심', '외접', '외접원', 
        '내심', '내접', '내접원', '중선', '무게중심', '닮음', '닮음비', '닮음 조건', '피타고라스의 정리', '삼각비', '사인', '코사인', '탄젠트', '원주각' , '변량', '줄기와 잎 그림', '계급', 
        '계급의 크기', '도수', '도수분포표', '히스토그램', '도수분포다각형', '상대도수', '사건', '확률', '중앙값', '최빈값', '대푯값', '산포도', '편차', '분산', '표준편차', '산점도', '상관관계',
        
        #공통수학
        '미정계수법', '나머지정리', '인수정리', '조립제법', '허수단위' ,'복소수', '실수부분', '허수부분', '허수', '켤레복소수', '실근', '허근', '판별식', '최댓값', '최솟값', '연립부등식',
        '내분', '외분', '대칭이동', '집합', '원소', '공집합', '부분집합', '진부분집합', '벤 다이어그램', '합집합', '교집합', '전체집합', '여집합', '차집합', '서로소', '교환법칙', '결합법칙', 
        '분배법칙', '드모르간의 법칙', '명제', '가정', '결론', '정의', '정리', '증명', '조건', '진리집합', '부정', '역','대우', '충분조건', '필요조건', '필요충분조건', '귀류법', '절대부등식',
        '정의역', '치역', '공역', '대응', '일대일대응', '항등함수', '상수함수', '일대일함수', '합성함수', '역함수', '다항함수', '유리식', '무리식', '유리함수', '점근선', '무리함수', '합의 법칙', 
        '곱의 법칙', '순열', '계승', '조합',
        
        #수학1
        '거듭제곱근', '로그', '밑','진수', '상용로그', '지수함수', '로그함수', '시초선', '동경', '일반각', '호도법', '라디안', '사인함수', '코사인함수', '탄젠트함수', '사인법칙', '코사인법칙', 
        '삼각함수', '주기', '주기함수', '수열', '항', '일반항', '공차', '등차수열', '등차중항', '공비', '등비수열', '등비중항','귀납적 정의', '수학적 귀납법' , 

        #수학2
        '구간', '닫힌구간', '열린구간', '반닫힌구간' , '반열린구간', '수렴', '극한' '극한값', '좌극한', '우극한', '발산', '무한대','연속', '불연속', '연속함수', '최대,최소 정리', '사잇값 정리', 
        '증분', '평균변화율', '순간변화율', '미분', '미분계수', '미분가능', '미분가능성','도함수', '롤의 정리', '평균값 정리', '증가', '감소', '극대', '극소', '극값', '극댓값', '극솟값', 
        '부정적분', '적분상수', '정적분' , 
        
        #미적분
        '급수', '부분합', '급수의 합', '등비급수', '자연로그', '덧셈정리', '매개변수', '음함수', '이계도함수', '변곡점', '치환적분법', '부분적분법'
        
        #확통
        '원순열', '중복순열', '중복조합', '이항정리', '이항계수', '파스칼의 삼각형', '시행', '통계적 확률', '수학적 확률', '여사건', '배반사건', '조건부확률', '종속', '독립', '독립시행', 
        '확률변수','이산확률변수', '확률분포', '연속확률변수', '기댓값', '이항분포', '큰수의 법칙', '정규분포', '표준정규분포', '모집단', '표본', '전수조사', '표본조사', '임의추출', '모평균', 
        '모분산', '모표준편차', '표본평균', '표본분산', '표본표준편차', '추정', '신뢰도', '신뢰구간',
        
        #확률과 통계
        "코시", '슈바르츠', '산술', '기하' ,'동치', "증명" , "계수", "나머지", "나머지정리", "다항식", "상수",  "삼차방정식", "수직", "양변", "연립", "이차식", "정리"
    ]
def add_custom_words(kiwi, text):
        # 다양한 패턴을 찾는 정규 표현식
        patterns = [
            r'\{\d+\}',                     # {숫자}        ex) {8}
            r'\{[a-zA-Z]+\}',               # {알파벳}      ex) {a} 
            r'[a-zA-Z]\^\{\d+\}',           # 알파벳^{숫자}  ex) a^{3}
            r'\d+\^\{\d+\}',                # 숫자^{숫자}  ex) a^{3}
            r'\d+[a-zA-Z]\^\{\d+\}',        # 숫자*알파벳^{숫자}  ex) 3a^{3}
            r'\([a-zA-Z]\+\d+\)',           # (알파벳+숫자)  ex) (a+2)  
            r'\([a-zA-Z]\-\d+\)',           # (알파벳-숫자)  ex) (a-2)
            r'\([a-zA-Z]+\+[a-zA-Z]+\)',    # (알파벳+알파벳) ex) (a+b) 
            r'\([a-zA-Z]\-[a-zA-Z]+\)',     #(알파벳-알파벳)  ex) (a-b)
            r'\(\d+\+[a-zA-Z]\)',           #(숫자+알파벳)   ex) (3+a)
            r'\(\d+\-[a-zA-Z]\)',           #(숫자-알파벳)   ex) (3-a)
            r'\d+[a-zA-Z]',                 #숫자*알파벳     ex) 8a
            r'[a-zA-Z]\_\d+',               #알파벳_숫자     ex) a_7    
            r'[a-zA-Z]\_[a-zA-Z]',          #알파벳_알파벳    ex) a_k
            r'\d+[a-zA-Z]\_\d+',            #숫자*알파벳_숫자 ex) 3a_4
            r'\d+[a-zA-Z]\_\[a-zA-Z]',      #숫자*알파벳_알파벳 ex) 3a_k
            r'sum_\{[a-z]=\d+\}\^\{\d+\}'            #sum_{알파벳=숫자} ex) sum_{n=1} 
        ]
        
        # 각 패턴에 맞는 단어를 사용자 사전에 추가
        for pattern in patterns:
            matches = re.findall(pattern, text)
            for match in set(matches):
                kiwi.add_user_word(match, 'NNP', 100)  # NNP (고유명사) 태그로 추가

def generate_answer(prob_num, num):
    # xlsx 파일 경로 설정
    xlsx_file = f'/Users/user/Desktop/임종욱선생님 프로젝트/Answer/{prob_num}번.xlsx'
    answer= []
    df = pd.read_excel(xlsx_file)
    for j in range(num):
        text_data = df.iloc[j, 0]
        answer.append(text_data)
        
    return answer

def generate_tokenizer(prob_num, num, concept_list):
    kiwi = Kiwi()
    kiwi2 = Kiwi()
    
    for word in concept_list:
        kiwi.add_user_word(word, "NNP")
    
    # 사용자 사전 추가 함수
    answer = generate_answer(prob_num, num)
    for doc in answer:
        # 사용자 사전 추가
        add_custom_words(kiwi, doc)  
    
    return kiwi, kiwi2, answer    